openfoam-pav/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10;          // Number of iterations for steady-state

deltaT          0.05;            // Time step (irrelevant for steady-state, but kept)

writeControl    adjustableRunTime;

writeInterval   0.1;         // Write every 10 iterations

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

// Optional: control max Co for adjustable time stepping (not typically needed for simpleFoam)
adjustTimeStep yes;
maxCo          1;
maxDeltaT      1e-1;


// ************************************************************************* //